CS/Python/EffectivePython.org
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t c:nil
#+OPTIONS: creator:nil d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t
#+OPTIONS: num:t p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t timestamp:t
#+OPTIONS: title:t toc:t todo:t |:t
#+TITLES: EffectivePython
#+DATE: <2017-05-31 Wed>
#+AUTHORS: weiwu
#+EMAIL: victor.wuv@gmail.com
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 24.5.1 (Org mode 8.3.4)


* Pythonic Thinking

** PEP 8 style guide

*** Naming:
- Protected instance attributes should be in _leading_underscore format.
- Private instance attributes should be in __double_leading_underscore
format.
- Classes and exceptions should be in CapitalizedWord format.
- Module-level constants should be in ALL_CAPS format.
- Instance methods in classes should use self as the name of the first parameter
(which refers to the object).
- Class methods should use cls as the name of the first parameter (which refers to
the class).
*** Expressions and Statements:
- Always use absolute names for modules when importing them, not names relative to the current module’s own path. For example, to import the foo module from the bar package, you should do from bar import foo, not just import foo.
- If you must do relative imports, use the explicit syntax from . import foo.
- Imports should be in sections in the following order: standard library modules, thirdparty modules, your own modules. Each subsection should have imports in alphabetical order.
** Differences between bytes, str, and unicode
- In Python 3, there are two types that represent sequences of characters: bytes and str. Instances of bytes contain raw 8-bit values. Instances of str contain Unicode characters.
- In Python 2, there are two types that represent sequences of characters: str and unicode. In contrast to Python 3, instances of str contain raw 8-bit values. Instances of unicode contain Unicode characters.
- To convert Unicode characters to binary data, you must use the encode method. To convert binary data to Unicode characters, you must use the decode method.
- When you’re writing Python programs, it’s important to do encoding and decoding of Unicode at the furthest boundary of your interfaces. The core of your program should use Unicode character types (str in Python 3, unicode in Python 2) and should not assume anything about character encodings.
** Slice Sequences

- Slicing lets you access a subset of a sequence’s items with minimal effort. The simplest uses for slicing are the built-in types list, str, and bytes.
- Python has special syntax for the stride of a slice in the form somelist[start:end:stride].
** Enumerate
enumerate wraps any iterator with a lazy generator.
#+BEGIN_SRC python
for i, flavor in enumerate(flavor_list):
print(‘%d: %s’ % (i + 1, flavor))
>>>
1: vanilla
2: chocolate
3: pecan
4: strawberry
#+END_SRC
** zip
There are two problems with the zip built-in.
- The first issue is that in Python 2 zip is not a generator; it will fully exhaust the supplied iterators and return a list of all the tuples it creates. This could potentially use a lot of memory and cause your program to crash. If you want to zip very large iterators in Python 2, you should use izip from the itertools built-in module.
- The second issue is that zip behaves strangely if the input iterators are of different lengths.
* Functions

* Classes and inheritance

* Metaclasses and atributes

* Concurrency and parallelism

* Built-in modules

** pickle
- The pickle built-in module is only useful for serializing and deserializing objects between trusted programs.
- The pickle module may break down when used for more than trivial use cases.
- Use the copyreg built-in module with pickle to add missing attribute values, allow versioning of classes, and provide stable import paths.

