docs/CS/Python/EffectivePython.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-06-03 Sat 13:31 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="weiwu" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline8">1. Pythonic Thinking</a>
<ul>
<li><a href="#orgheadline3">1.1. PEP 8 style guide</a>
<ul>
<li><a href="#orgheadline1">1.1.1. Naming:</a></li>
<li><a href="#orgheadline2">1.1.2. Expressions and Statements:</a></li>
</ul>
</li>
<li><a href="#orgheadline4">1.2. Differences between bytes, str, and unicode</a></li>
<li><a href="#orgheadline5">1.3. Slice Sequences</a></li>
<li><a href="#orgheadline6">1.4. Enumerate</a></li>
<li><a href="#orgheadline7">1.5. zip</a></li>
</ul>
</li>
<li><a href="#orgheadline9">2. Functions</a></li>
<li><a href="#orgheadline10">3. Classes and inheritance</a></li>
<li><a href="#orgheadline11">4. Metaclasses and atributes</a></li>
<li><a href="#orgheadline12">5. Concurrency and parallelism</a></li>
<li><a href="#orgheadline18">6. Built-in modules</a>
<ul>
<li><a href="#orgheadline13">6.1. pickle</a></li>
<li><a href="#orgheadline14">6.2. datetime</a></li>
<li><a href="#orgheadline15">6.3. Ordered dictionary</a></li>
<li><a href="#orgheadline16">6.4. Default Dictionary</a></li>
<li><a href="#orgheadline17">6.5. Decimal for precision</a></li>
</ul>
</li>
<li><a href="#orgheadline23">7. Collaboration</a>
<ul>
<li><a href="#orgheadline19">7.1. Documenting</a></li>
<li><a href="#orgheadline21">7.2. Packages</a>
<ul>
<li><a href="#orgheadline20">7.2.1. stable API</a></li>
</ul>
</li>
<li><a href="#orgheadline22">7.3. Virtual environments</a></li>
</ul>
</li>
<li><a href="#orgheadline29">8. Production</a>
<ul>
<li><a href="#orgheadline25">8.1. Test Everything with unittest</a>
<ul>
<li><a href="#orgheadline24">8.1.1. unittest.mock built-in module</a></li>
</ul>
</li>
<li><a href="#orgheadline27">8.2. Profile before optimizing</a>
<ul>
<li><a href="#orgheadline26">8.2.1. enhancing performance with Cython(writing C extensions for pandas)</a></li>
</ul>
</li>
<li><a href="#orgheadline28">8.3. Use tracemalloc to Understand Memory Usage and Leaks</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">1</span> Pythonic Thinking</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.1</span> PEP 8 style guide</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-orgheadline1" class="outline-4">
<h4 id="orgheadline1"><span class="section-number-4">1.1.1</span> Naming:</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>Protected instance attributes should be in _leading<sub>underscore</sub> format.</li>
<li>Private instance attributes should be in _<sub>double</sub><sub>leading</sub><sub>underscore</sub></li>
</ul>
<p>
format.
</p>
<ul class="org-ul">
<li>Classes and exceptions should be in CapitalizedWord format.</li>
<li>Module-level constants should be in ALL<sub>CAPS</sub> format.</li>
<li>Instance methods in classes should use self as the name of the first parameter</li>
</ul>
<p>
(which refers to the object).
</p>
<ul class="org-ul">
<li>Class methods should use cls as the name of the first parameter (which refers to</li>
</ul>
<p>
the class).
</p>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-4">
<h4 id="orgheadline2"><span class="section-number-4">1.1.2</span> Expressions and Statements:</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>Always use absolute names for modules when importing them, not names relative to the current module’s own path. For example, to import the foo module from the bar package, you should do from bar import foo, not just import foo.</li>
<li>If you must do relative imports, use the explicit syntax from . import foo.</li>
<li>Imports should be in sections in the following order: standard library modules, thirdparty modules, your own modules. Each subsection should have imports in alphabetical order.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.2</span> Differences between bytes, str, and unicode</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>In Python 3, there are two types that represent sequences of characters: bytes and str. Instances of bytes contain raw 8-bit values. Instances of str contain Unicode characters.</li>
<li>In Python 2, there are two types that represent sequences of characters: str and unicode. In contrast to Python 3, instances of str contain raw 8-bit values. Instances of unicode contain Unicode characters.</li>
<li>To convert Unicode characters to binary data, you must use the encode method. To convert binary data to Unicode characters, you must use the decode method.</li>
<li>When you’re writing Python programs, it’s important to do encoding and decoding of Unicode at the furthest boundary of your interfaces. The core of your program should use Unicode character types (str in Python 3, unicode in Python 2) and should not assume anything about character encodings.</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">1.3</span> Slice Sequences</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Slicing lets you access a subset of a sequence’s items with minimal effort. The simplest uses for slicing are the built-in types list, str, and bytes.</li>
<li>Python has special syntax for the stride of a slice in the form somelist[start:end:stride].</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">1.4</span> Enumerate</h3>
<div class="outline-text-3" id="text-1-4">
<p>
enumerate wraps any iterator with a lazy generator.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #F92672;">for</span> i, flavor <span style="color: #F92672;">in</span> <span style="color: #F92672;">enumerate</span><span style="color: #AE81FF;">(</span>flavor_list<span style="color: #AE81FF;">)</span>:
<span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span>&#8216;%d: %s&#8217; % <span style="color: #66D9EF;">(</span>i + <span style="color: #AE81FF;">1</span>, flavor<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
&gt;&gt;&gt;
<span style="color: #AE81FF;">1</span>: vanilla
<span style="color: #AE81FF;">2</span>: chocolate
<span style="color: #AE81FF;">3</span>: pecan
<span style="color: #AE81FF;">4</span>: strawberry
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">1.5</span> zip</h3>
<div class="outline-text-3" id="text-1-5">
<p>
There are two problems with the zip built-in.
</p>
<ul class="org-ul">
<li>The first issue is that in Python 2 zip is not a generator; it will fully exhaust the supplied iterators and return a list of all the tuples it creates. This could potentially use a lot of memory and cause your program to crash. If you want to zip very large iterators in Python 2, you should use izip from the itertools built-in module.</li>
<li>The second issue is that zip behaves strangely if the input iterators are of different lengths.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9"><span class="section-number-2">2</span> Functions</h2>
</div>

<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">3</span> Classes and inheritance</h2>
</div>

<div id="outline-container-orgheadline11" class="outline-2">
<h2 id="orgheadline11"><span class="section-number-2">4</span> Metaclasses and atributes</h2>
</div>

<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12"><span class="section-number-2">5</span> Concurrency and parallelism</h2>
</div>

<div id="outline-container-orgheadline18" class="outline-2">
<h2 id="orgheadline18"><span class="section-number-2">6</span> Built-in modules</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">6.1</span> pickle</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>The pickle built-in module is only useful for serializing and deserializing objects between trusted programs.</li>
<li>The pickle module may break down when used for more than trivial use cases.</li>
<li>Use the copyreg built-in module with pickle to add missing attribute values, allow versioning of classes, and provide stable import paths.</li>
</ul>
</div>
</div>
