CS/Python/EffectivePython.org
** datetime
converting time between UTC and local clocks.
#+BEGIN_SRC python
# UTC to local
from time import localtime, strftime
now = 1407694710
local_tuple = localtime(now)
time_format = ‘%Y-%m-%d %H:%M:%S’
time_str = strftime(time_format, local_tuple)
print(time_str)
# local to UTC
time_tuple = strptime(time_str, time_format)
utc_now = mktime(time_tuple)
print(utc_now)
#+END_SRC
#+BEGIN_SRC python
# take present time in UTC and convert it to local time.
from datetime import datetime, timezone
now = datetime(2014, 8, 10, 18, 18, 30)
now_utc = now.replace(tzinfo=timezone.utc)
now_local = now_utc.astimezone()
print(now_local)
>>>
2014-08-10 11:18:30-07:00
#+END_SRC

** Ordered dictionary
Standard dictionaries are unordered. That means a dict with the same keys and values can result in different orders of iteration. This behavior is a surprising byproduct of the way the dictionary’s fast hash table is implemented.
The OrderedDict class from the collections module is a special type of dictionary that keeps track of the order in which its keys were inserted. Iterating the keys of an OrderedDict has predictable behavior. This can vastly simplify testing and debugging by making all code deterministic.

** Default Dictionary
One problem with dictionaries is that you can’t assume any keys are already present.
If you wish to increment a counter stored in a dictionary when that counter key is not existed in the dictionary before, you have to assign a default value to that key.
#+BEGIN_SRC python
stats = {}
key = 'my_counter'
if key not in stats:
stats[key] = 0
stats[key] += 1

# Using defaultdict doesn't have such problem.
from collections import defaultdict
stats = defaultdict(int)
stats['my_counter'] += 1
#+END_SRC

** Decimal for precision
#+BEGIN_SRC python
rounded = number.quantize(Decimal(‘0.01’), rounding=ROUND_UP)
print(rounded)
#+END_SRC
* Collaboration

** Documenting
Write docstrings for every function, class, and module.

** Packages
#+BEGIN_EXAMPLE
--main.py
--mypackage
    |-- __init__.py
    |-- mypackage/models.py
    |-- mypackage/utils.py
#+END_EXAMPLE
#+BEGIN_SRC python
# main.py
from mypackage import utils
#+END_SRC

*** stable API
The value of __all__ is a list of every name to
export from the module as part of its public API.
#+BEGIN_SRC python
# utils.py
from . models import Projectile
all__ = [‘simulate_collision’]
def _dot_product(a, b):
# …
def simulate_collision(a, b):
# …
# __init__.py
all__ = []
from . models import *
all__ += models.__all__
from . utils import *
all__ += utils.__all__
# api_consumer.py
from mypackage import *
a = Projectile(1.5, 3)
b = Projectile(4, 1.7)
after_a, after_b = simulate_collision(a, b)
#+END_SRC
internal-only functions like mypackage.utils._dot_product will not be
available to the API consumer on mypackage because they weren’t present in all__. Being omitted from __all__ means they weren’t imported by the from mypackage import * statement.

** Virtual environments

- By default, pip installs new packages in a global location. That
causes all Python programs on your system to be affected by these installed modules. If one package requires newer version of another package, which could cause conflict version dependency issue.
pip3 show flask
pip3 show Sphinx
- use the pip freeze command to save all
of your explicit package dependencies into a file.
#+BEGIN_SRC python
pip freeze > requirements.txt
pip install -r requirements.txt
#+END_SRC
* Production
