docs/CS/Python/EffectivePython.html

<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">6.2</span> datetime</h3>
<div class="outline-text-3" id="text-6-2">
<p>
converting time between UTC and local clocks.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #75715E;"># </span><span style="color: #75715E;">UTC to local</span>
<span style="color: #F92672;">from</span> time <span style="color: #F92672;">import</span> localtime, strftime
<span style="color: #FD971F;">now</span> = <span style="color: #AE81FF;">1407694710</span>
<span style="color: #FD971F;">local_tuple</span> = localtime<span style="color: #AE81FF;">(</span>now<span style="color: #AE81FF;">)</span>
<span style="color: #FD971F;">time_format</span> = &#8216;%Y-%m-%d %H:%M:%S&#8217;
<span style="color: #FD971F;">time_str</span> = strftime<span style="color: #AE81FF;">(</span>time_format, local_tuple<span style="color: #AE81FF;">)</span>
<span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span>time_str<span style="color: #AE81FF;">)</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">local to UTC</span>
<span style="color: #FD971F;">time_tuple</span> = strptime<span style="color: #AE81FF;">(</span>time_str, time_format<span style="color: #AE81FF;">)</span>
<span style="color: #FD971F;">utc_now</span> = mktime<span style="color: #AE81FF;">(</span>time_tuple<span style="color: #AE81FF;">)</span>
<span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span>utc_now<span style="color: #AE81FF;">)</span>
</pre>
</div>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #75715E;"># </span><span style="color: #75715E;">take present time in UTC and convert it to local time.</span>
<span style="color: #F92672;">from</span> datetime <span style="color: #F92672;">import</span> datetime, timezone
<span style="color: #FD971F;">now</span> = datetime<span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">2014</span>, <span style="color: #AE81FF;">8</span>, <span style="color: #AE81FF;">10</span>, <span style="color: #AE81FF;">18</span>, <span style="color: #AE81FF;">18</span>, <span style="color: #AE81FF;">30</span><span style="color: #AE81FF;">)</span>
<span style="color: #FD971F;">now_utc</span> = now.replace<span style="color: #AE81FF;">(</span>tzinfo=timezone.utc<span style="color: #AE81FF;">)</span>
<span style="color: #FD971F;">now_local</span> = now_utc.astimezone<span style="color: #AE81FF;">()</span>
<span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span>now_local<span style="color: #AE81FF;">)</span>
&gt;&gt;&gt;
<span style="color: #AE81FF;">2014</span>-<span style="color: #AE81FF;">08</span>-<span style="color: #AE81FF;">10</span> <span style="color: #AE81FF;">11</span>:<span style="color: #AE81FF;">18</span>:<span style="color: #AE81FF;">30</span>-<span style="color: #AE81FF;">07</span>:<span style="color: #AE81FF;">00</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">6.3</span> Ordered dictionary</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Standard dictionaries are unordered. That means a dict with the same keys and values can result in different orders of iteration. This behavior is a surprising byproduct of the way the dictionary’s fast hash table is implemented.
The OrderedDict class from the collections module is a special type of dictionary that keeps track of the order in which its keys were inserted. Iterating the keys of an OrderedDict has predictable behavior. This can vastly simplify testing and debugging by making all code deterministic.
</p>
</div>
</div>

<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">6.4</span> Default Dictionary</h3>
<div class="outline-text-3" id="text-6-4">
<p>
One problem with dictionaries is that you can’t assume any keys are already present.
If you wish to increment a counter stored in a dictionary when that counter key is not existed in the dictionary before, you have to assign a default value to that key.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #FD971F;">stats</span> = <span style="color: #AE81FF;">{}</span>
<span style="color: #FD971F;">key</span> = <span style="color: #E6DB74;">'my_counter'</span>
<span style="color: #F92672;">if</span> key <span style="color: #F92672;">not</span> <span style="color: #F92672;">in</span> stats:
<span style="color: #FD971F;">stats</span><span style="color: #AE81FF;">[</span>key<span style="color: #AE81FF;">]</span> = <span style="color: #AE81FF;">0</span>
<span style="color: #FD971F;">stats</span><span style="color: #AE81FF;">[</span>key<span style="color: #AE81FF;">]</span> += <span style="color: #AE81FF;">1</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">Using defaultdict doesn't have such problem.</span>
<span style="color: #F92672;">from</span> collections <span style="color: #F92672;">import</span> defaultdict
<span style="color: #FD971F;">stats</span> = defaultdict<span style="color: #AE81FF;">(</span><span style="color: #F92672;">int</span><span style="color: #AE81FF;">)</span>
<span style="color: #FD971F;">stats</span><span style="color: #AE81FF;">[</span><span style="color: #E6DB74;">'my_counter'</span><span style="color: #AE81FF;">]</span> += <span style="color: #AE81FF;">1</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17"><span class="section-number-3">6.5</span> Decimal for precision</h3>
<div class="outline-text-3" id="text-6-5">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #FD971F;">rounded</span> = number.quantize<span style="color: #AE81FF;">(</span>Decimal<span style="color: #66D9EF;">(</span>&#8216;<span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">01</span>&#8217;<span style="color: #66D9EF;">)</span>, rounding=ROUND_UP<span style="color: #AE81FF;">)</span>
<span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span>rounded<span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline23" class="outline-2">
<h2 id="orgheadline23"><span class="section-number-2">7</span> Collaboration</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19"><span class="section-number-3">7.1</span> Documenting</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Write docstrings for every function, class, and module.
</p>
</div>
</div>

<div id="outline-container-orgheadline21" class="outline-3">
<h3 id="orgheadline21"><span class="section-number-3">7.2</span> Packages</h3>
<div class="outline-text-3" id="text-7-2">
<pre class="example">
--main.py
--mypackage
    |-- __init__.py
    |-- mypackage/models.py
    |-- mypackage/utils.py
</pre>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #75715E;"># </span><span style="color: #75715E;">main.py</span>
<span style="color: #F92672;">from</span> mypackage <span style="color: #F92672;">import</span> utils
</pre>
</div>
</div>

<div id="outline-container-orgheadline20" class="outline-4">
<h4 id="orgheadline20"><span class="section-number-4">7.2.1</span> stable API</h4>
<div class="outline-text-4" id="text-7-2-1">
<p>
The value of <span class="underline"><span class="underline">all</span></span> is a list of every name to
export from the module as part of its public API.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #75715E;"># </span><span style="color: #75715E;">utils.py</span>
<span style="color: #F92672;">from</span> . models <span style="color: #F92672;">import</span> Projectile
<span style="color: #FD971F;">all__</span> = <span style="color: #AE81FF;">[</span>&#8216;simulate_collision&#8217;<span style="color: #AE81FF;">]</span>
<span style="color: #F92672;">def</span> <span style="color: #A6E22E;">_dot_product</span><span style="color: #AE81FF;">(</span>a, b<span style="color: #AE81FF;">)</span>:
<span style="color: #75715E;"># </span><span style="color: #75715E;">&#8230;</span>
<span style="color: #F92672;">def</span> <span style="color: #A6E22E;">simulate_collision</span><span style="color: #AE81FF;">(</span>a, b<span style="color: #AE81FF;">)</span>:
<span style="color: #75715E;"># </span><span style="color: #75715E;">&#8230;</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">__init__.py</span>
<span style="color: #FD971F;">all__</span> = <span style="color: #AE81FF;">[]</span>
<span style="color: #F92672;">from</span> . models <span style="color: #F92672;">import</span> *
<span style="color: #FD971F;">all__</span> += models.<span style="color: #F92672;">__all__</span>
<span style="color: #F92672;">from</span> . utils <span style="color: #F92672;">import</span> *
<span style="color: #FD971F;">all__</span> += utils.<span style="color: #F92672;">__all__</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">api_consumer.py</span>
<span style="color: #F92672;">from</span> mypackage <span style="color: #F92672;">import</span> *
<span style="color: #FD971F;">a</span> = Projectile<span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">1</span>.<span style="color: #AE81FF;">5</span>, <span style="color: #AE81FF;">3</span><span style="color: #AE81FF;">)</span>
<span style="color: #FD971F;">b</span> = Projectile<span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">4</span>, <span style="color: #AE81FF;">1</span>.<span style="color: #AE81FF;">7</span><span style="color: #AE81FF;">)</span>
<span style="color: #FD971F;">after_a</span>, <span style="color: #FD971F;">after_b</span> = simulate_collision<span style="color: #AE81FF;">(</span>a, b<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
internal-only functions like mypackage.utils.<sub>dot</sub><sub>product</sub> will not be
available to the API consumer on mypackage because they weren’t present in all__. Being omitted from <span class="underline"><span class="underline">all</span></span> means they weren’t imported by the from mypackage import * statement.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline22" class="outline-3">
<h3 id="orgheadline22"><span class="section-number-3">7.3</span> Virtual environments</h3>
<div class="outline-text-3" id="text-7-3">
<ul class="org-ul">
<li>By default, pip installs new packages in a global location. That</li>
</ul>
<p>
causes all Python programs on your system to be affected by these installed modules. If one package requires newer version of another package, which could cause conflict version dependency issue.
pip3 show flask
pip3 show Sphinx
</p>
<ul class="org-ul">
<li>use the pip freeze command to save all</li>
</ul>
<p>
of your explicit package dependencies into a file.
</p>
<div class="org-src-container">

<pre class="src src-python">pip freeze &gt; requirements.txt
pip install -r requirements.txt
</pre>
</div>
</div>
</div>
</div>
