docs/CS/Python/EffectivePython.html
<div id="outline-container-orgheadline29" class="outline-2">
<h2 id="orgheadline29"><span class="section-number-2">8</span> Production</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-orgheadline25" class="outline-3">
<h3 id="orgheadline25"><span class="section-number-3">8.1</span> Test Everything with unittest</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #75715E;"># </span><span style="color: #75715E;">utils.py</span>
<span style="color: #F92672;">def</span> <span style="color: #A6E22E;">to_str</span><span style="color: #AE81FF;">(</span>data<span style="color: #AE81FF;">)</span>:
<span style="color: #F92672;">if</span> <span style="color: #F92672;">isinstance</span><span style="color: #AE81FF;">(</span>data, <span style="color: #F92672;">str</span><span style="color: #AE81FF;">)</span>:
    <span style="color: #F92672;">return</span> data
<span style="color: #F92672;">elif</span> <span style="color: #F92672;">isinstance</span><span style="color: #AE81FF;">(</span>data, <span style="color: #F92672;">bytes</span><span style="color: #AE81FF;">)</span>:
    <span style="color: #F92672;">return</span> data.decode<span style="color: #AE81FF;">(</span>&#8216;utf-<span style="color: #AE81FF;">8</span>&#8217;<span style="color: #AE81FF;">)</span>
<span style="color: #F92672;">else</span>:
    <span style="color: #F92672;">raise</span> <span style="color: #66D9EF;">TypeError</span><span style="color: #AE81FF;">(</span>&#8216;Must supply <span style="color: #F92672;">str</span> <span style="color: #F92672;">or</span> <span style="color: #F92672;">bytes</span>, &#8216;
&#8216;found: %r&#8217; % data<span style="color: #AE81FF;">)</span>
</pre>
</div>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #75715E;"># </span><span style="color: #75715E;">utils_test.py</span>
<span style="color: #F92672;">from</span> unittest <span style="color: #F92672;">import</span> TestCase, main
<span style="color: #F92672;">from</span> utils <span style="color: #F92672;">import</span> to_str
<span style="color: #F92672;">class</span> <span style="color: #66D9EF;">UtilsTestCase</span><span style="color: #AE81FF;">(</span>TestCase<span style="color: #AE81FF;">)</span>:
    <span style="color: #F92672;">def</span> <span style="color: #A6E22E;">test_to_str_bytes</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span><span style="color: #AE81FF;">)</span>:
        <span style="color: #F92672;">self</span>.assertEqual<span style="color: #AE81FF;">(</span>&#8216;hello&#8217;, to_str<span style="color: #66D9EF;">(</span>b&#8217;hello&#8217;<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
    <span style="color: #F92672;">def</span> <span style="color: #A6E22E;">test_to_str_str</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span><span style="color: #AE81FF;">)</span>:
        <span style="color: #F92672;">self</span>.assertEqual<span style="color: #AE81FF;">(</span>&#8216;hello&#8217;, to_str<span style="color: #66D9EF;">(</span>&#8216;hello&#8217;<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
    <span style="color: #F92672;">def</span> <span style="color: #A6E22E;">test_to_str_bad</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span><span style="color: #AE81FF;">)</span>:
        <span style="color: #F92672;">self</span>.assertRaises<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">TypeError</span>, to_str, <span style="color: #F92672;">object</span><span style="color: #66D9EF;">()</span><span style="color: #AE81FF;">)</span>
<span style="color: #F92672;">if</span> <span style="color: #F92672;">__name__</span> == &#8216;__main__&#8217;:
    main<span style="color: #AE81FF;">()</span>
</pre>
</div>
<p>
The TestCase class provides helper methods for making assertions in your tests, such as assertEqual for verifying equality, assertTrue for verifying Boolean expressions, and assertRaises for verifying that exceptions are raised when appropriate (see help(TestCase) for more). You can define your own helper methods in TestCase subclasses to make your tests more readable; just ensure that your method names don’t begin with the word test.
</p>
</div>
<div id="outline-container-orgheadline24" class="outline-4">
<h4 id="orgheadline24"><span class="section-number-4">8.1.1</span> unittest.mock built-in module</h4>
<div class="outline-text-4" id="text-8-1-1">
<p>
<a href="http://nose.readthedocs.org/">NoseTest</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline27" class="outline-3">
<h3 id="orgheadline27"><span class="section-number-3">8.2</span> Profile before optimizing</h3>
<div class="outline-text-3" id="text-8-2">
<ol class="org-ol">
<li>如何查看python程序的运行效率：</li>
</ol>
<p>
The dynamic nature of Python causes surprising behaviors in its runtime performance.
Operations you might assume are slow are actually very fast (string manipulation,
generators). Language features you might assume are fast are actually very slow (attribute
access, function calls). The true source of slowdowns in a Python program can be obscure.
The best approach is to ignore your intuition and directly measure the performance of a
program before you try to optimize it. Python provides a built-in profiler for determining
which parts of a program are responsible for its execution time. This lets you focus your
optimization efforts on the biggest sources of trouble and ignore parts of the program that
don’t impact speed.
STEPS:
1). install snakeviz using pip from cmd.
</p>
<div class="org-src-container">

<pre class="src src-shell">pip install snakeviz
</pre>
</div>

<p>
2). profile the test python file using below command.
</p>
<div class="org-src-container">

<pre class="src src-shell">$ python -m cProfile -o profile.stats test.py
<span style="color: #75715E;"># </span><span style="color: #75715E;">test.py</span>
from random import randint
<span style="color: #FD971F;">max_size</span> = <span style="color: #AE81FF;">10**4</span>
<span style="color: #FD971F;">data</span> = <span style="color: #AE81FF;">[</span>randint<span style="color: #66D9EF;">(</span><span style="color: #AE81FF;">0,</span> max_size<span style="color: #66D9EF;">)</span> <span style="color: #F92672;">for</span> _<span style="color: #F92672;"> in</span> range<span style="color: #66D9EF;">(</span>max_size<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">]</span>
<span style="color: #FD971F;">test</span> = lambda: insertion_sort<span style="color: #AE81FF;">(</span>data<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
3). check the efficiency result from profile.stats file.
</p>
<div class="org-src-container">

<pre class="src src-shell">$ snakeviz profile.stats
</pre>
</div>
</div>
<div id="outline-container-orgheadline26" class="outline-4">
<h4 id="orgheadline26"><span class="section-number-4">8.2.1</span> enhancing performance with Cython(writing C extensions for pandas)</h4>
</div>
</div>

<div id="outline-container-orgheadline28" class="outline-3">
<h3 id="orgheadline28"><span class="section-number-3">8.3</span> Use tracemalloc to Understand Memory Usage and Leaks</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-05-31 Wed&gt;</span></span></p>
<p class="author">Author: weiwu</p>
<p class="date">Created: 2017-06-03 Sat 13:31</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
